# Thickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisMaterial..::..Thickness Property
EnergyAnalysisMaterial Class See Also
---
The thickness of the material.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double Thickness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Thickness As Double
	Get
```

Visual C++
---
```text
public:
property double Thickness {
	double get ();
}
```

# See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace